In [1]:
# We will load all required modules first.
try:
    from dstaster import *
except:
    !pip install wget

    import wget
    url = 'https://raw.githubusercontent.com/BBKdatasciencetaster/DS/main/dstaster.py'
    wget.download(url)
    from dstaster import *

Collecting wget
  Downloading wget-3.2.zip (10 kB)
Building wheels for collected packages: wget
  Building wheel for wget (setup.py) ... done
  Created wheel for wget: filename=wget-3.2-py3-none-any.whl size=9672 sha256=142245ed64c277d06632d1851d06902bccec4094495330da310d0f63134a995f
  Stored in directory: /root/.cache/pip/wheels/a1/b6/7c/0e63e34eb06634181c63adacca38b79ff8f35c37e3c13e3c02
Successfully built wget
Installing collected packages: wget
Successfully installed wget-3.2

<h2>Loading the dataset with pandas</h2>

In this notebook we will use the pandas library to load the data from a comma-separated file. The file itself stores our data in a very simple table-like format:

<pre style="font-size:10pt">
,artist,title,year,groundtruth,height,width
T13896,John Constable,Salisbury Cathedral from the Meadows,1831,L,1537,1920
T05010,Pablo Picasso,Weeping Woman,1937,O,608,500
N05915,Pablo Picasso,Bust of a Woman,1909,P,727,600
N00530,Joseph Mallord William Turner,Snow Storm - Steam-Boat off a Harbour’s Mouth,1842,L,914,1219
T00598,Richard Dadd,The Fairy Feller’s Master-Stroke,1855,O,540,394
...
</pre>

The first row contains the names of the different columns, every following line contains elements from the dataset. Now, we need to load this data into the notebook to work with it.  The following code cells shows how: it loads a dataset and stores it in the variable `collection`. The data is stored in a so-called `DataFrame` which is provided to us by the `pandas` library (abbreviated in the code by `pd`).

The second line passes the DataFrame to the magic Jupyter `display(...)` function which provides us with a pretty-printed excerpt of the dataset. If you run the cell, you should see a table with six columns (artist, title, year, groundtruth, height and width).

In [2]:
collection = pd.read_csv("https://raw.githubusercontent.com/BBKdatasciencetaster/DS/main/data/paintings.csv", index_col=0)
display(collection)

                                artist  ... width
T13896                  John Constable  ...  1920
T05010                   Pablo Picasso  ...   500
N05915                   Pablo Picasso  ...   600
N00530   Joseph Mallord William Turner  ...  1219
T00598                    Richard Dadd  ...   394
...                                ...  ...   ...
N05609                  Maurice Sterne  ...  1022
T14823                  Unknown artist  ...   480
AL00397               Louise Bourgeois  ...  1116
T14824                  Unknown artist  ...   511
T14825                  Unknown artist  ...   455

[2158 rows x 6 columns]

Pandas DataFrames are very powerful data structures that come with a lot of useful functionality. For example, we can ask the DataFrame to compute common statistics for all numerical columns. When we call `collection.describe()` we receive a new DataFrame containing the summary of `collection`. Note that we can leave away the call to `display`: Jupyter automatically displays whatever the last statement in the cell returns.

In [3]:
collection.describe()

              year       height        width
count  2158.000000  2158.000000  2158.000000
mean   1873.828082   960.444856  1026.646895
std      76.739168   529.841346   642.269151
min    1594.000000   137.000000   102.000000
25%    1824.000000   610.000000   616.000000
50%    1889.500000   813.000000   893.500000
75%    1934.000000  1219.000000  1232.000000
max    2017.000000  4285.000000  8915.000000

<h2>Working with columns</h2>

Each column of the DataFrame can be access individually using the index brackets `[]`. For example, `collection['artist']` will give us the artist column, `collection['year']` the year column and so on. 

<div class="note">Note: A single column of a DataFrame is a data structure called a Series, so it's representation in the notebook looks slightly differently.</div>

<div class="task">
    <div class="no">1</div>
    <div class="text">
        Change the index string in the following cell to
        values other than <code>'artist'</code> and observe how 
        the output changes.
    </div>
</div>

In [4]:
collection['artist']

T13896                    John Constable
T05010                     Pablo Picasso
N05915                     Pablo Picasso
N00530     Joseph Mallord William Turner
T00598                      Richard Dadd
                       ...
N05609                    Maurice Sterne
T14823                    Unknown artist
AL00397                 Louise Bourgeois
T14824                    Unknown artist
T14825                    Unknown artist
Name: artist, Length: 2158, dtype: object

Pandas series also come equip with a number of methods that allow us to quickly compute various statistics. Let's say we want to find out which artist appear most often in our dataset. Then we can use the method `.value_counts()` to obtain a count for every unique entry in `collection['artist']`. The output is already sorted from hight to low, so we can read of the most common artist at the top:

In [5]:
collection['artist'].value_counts()

Joseph Mallord William Turner    240
John Constable                    34
John Singer Sargent               32
Sir Joshua Reynolds               30
Thomas Gainsborough               25
                                ...
Maurice Greiffenhagen              1
George Smith of Chichester         1
Michael Gross                      1
Allen Jones                        1
Hugh Carter                        1
Name: artist, Length: 869, dtype: int64

The <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html">complete list of available methods</a> to aggregate and modify pandas Series is quite long! A few methods we are interested in are `.sum()`, `.count()`, `.mean()`, `.min()`, `.median()`, and `.max()`.

<div class="task">
    <div class="no">2</div>
    <div class="text">
        Change <code>.sum()</code> in the following cell to the methods 
        mentioned above and observe the resulting output.
    </div>
</div>

In [6]:
collection['width'].sum()

2215504